/*Задача 10. Напишете програма на С, която съдържа 3 функции, изнесете
прототипите им в отделен .h файл.
1. Първата функция да калкулира най-малко общо кратно на две положителни
числа.
2. Втората функция връща абсолютна стойност на числата (положителната
стойност на числата).
a. Трябва да може да приеме като параметър float и да върне float.
b. Тествайте с инт и float.
3. Напишете функция, която калкулира корен квадратен от число.
a. Проверете дали резултатът е отрицателно число и върнете -1.
b. Използвайте втората си функция, за да обърнете числото в положително и да
намерите корен квадратен от него.*/

#include <stdio.h>
#include <math.h>
unsigned int nok(unsigned int a, unsigned int b )
{
int nok;
    int  i, gcd;

    for( i = 1; i <= a && i <= b; ++i)
    {
        if (a % i ==0 && b % i == 0)
            gcd = i;
    }

   nok=((a*b)/gcd);

    printf (" Nok is: %d.", nok);
}
double absol(float a){

printf("\n Fabs is :%f\n",fabs(a));

}
double squareRoot(double a){
if(a<0) absol(a);

return sqrt(a);
}

int main()
{
   nok(36,96);
    absol(-12.13412);
squareRoot(8);
    return 0;
}
